cask_args appdir: "/Applications"

brew "tmux"
# brew "youtube-dl" # Deprecated, use yt-dlp instead
brew "autojump"
brew "ffmpeg"
brew "gh"
brew "pyenv"
brew "k9s"
brew "redis"
brew "httpie"
brew "yq"
brew "jq"
brew "mysql"
brew "watch"
brew "zsh-syntax-highlighting"
brew "eza"
brew "bat"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "fd"
brew "zoxide"

cask "google-chrome"
cask "sublime-text"
cask "webstorm"
cask "spotify"
cask "iterm2"
cask "zoom"
# cask "docker"
cask "slack"
cask "penc"
cask "obsidian"
cask "postman"
cask "flycut"
cask "obs"
cask "visual-studio-code"
cask "1password"
cask "1password/tap/1password-cli"
cask "notion"
cask "vlc"
