cask_args appdir: "/Applications"

# Common formulas
brew "watch"
brew "zsh-syntax-highlighting"
brew "eza"
brew "bat"
brew "fzf"
brew "fd"
brew "zoxide"
brew "git-delta"
brew "stow"
brew "procs"
brew "starship"
brew "fnm"
brew "pandoc"
tap "dlvhdr/formulae"
brew "diffnav"
cask "font-hack-nerd-font"
brew "gum"
brew "glow"
brew "rtk"
tap "modem-dev/tap", trusted: true
brew "hunk"

# AI tools
tap "anomalyco/tap", trusted: true
brew "opencode"

if RUBY_PLATFORM =~ /linux/
  tap "atlassian/homebrew-acli", trusted: true
  tap "gleanwork/tap", trusted: true
  brew "acli"
  brew "glean-cli"
end

# macos 
if RUBY_PLATFORM =~ /darwin/
  # general terminal tools
  brew "tmux" # tmux is already installed in cde
  brew "httpie"
  brew "yq"
  brew "jq"
  brew "ripgrep"
  brew "tree"
  brew "ffmpeg"
  brew "gh"
  brew "uv"
  brew "oven-sh/bun/bun"
  brew "fresh-editor"
  brew "backlog-md"


  # cloud CLIs
  brew "awscli"
  brew "tailscale"
  # ona
  tap "gitpod-io/tap", trusted: true
  brew "ona"

  # dev tools for specific stacks
  # brew "k9s"
  # brew "redis"
  
  
  # macOS utilities
  brew "FelixKratz/formulae/borders", trusted: true
  brew "felixkratz/formulae/sketchybar", trusted: true

  # casks
  
  cask "sublime-text"
  # cask "webstorm"
  cask "spotify"
  # cask "iterm2"
  cask "zoom"
  cask "slack"
  cask "obsidian"
  cask "postman"
  cask "raycast"
  cask "obs"
  # uncomment when bootstrapping for the first time
  #cask "visual-studio-code"
  #cask "1password"
  #cask "1password/tap/1password-cli"
 # cask "notion"
 # cask "google-chrome"
  cask "vlc"
  cask "nikitabobko/tap/aerospace", trusted: true
  cask "ghostty"
  cask "arc"
  cask "superwhisper"
end

