cask_args appdir: "/Applications"

# Common formulas
brew "watch"
brew "zsh-syntax-highlighting"
brew "eza"
brew "bat"
brew "fzf"
brew "fd"
brew "zoxide"
brew "git-delta"
brew "stow"
brew "lnav"
brew "procs"
brew "starship"
brew "fnm"
brew "pandoc"
tap "dlvhdr/formulae"
brew "diffnav"
cask "font-hack-nerd-font"
brew "gum"
brew "rtk"

# AI tools
brew "anomalyco/tap/opencode"

if RUBY_PLATFORM =~ /linux/
  brew "atlassian/homebrew-acli/acli"
  brew "gleanwork/tap/glean-cli"
end

if RUBY_PLATFORM =~ /darwin/
  # general terminal tools
  brew "tmux" # tmux is already installed in cde
  brew "httpie"
  brew "yq"
  brew "jq"
  brew "ripgrep"
  brew "tree"
  brew "ffmpeg"
  brew "gh"
  brew "uv"



  # cloud CLIs
  brew "awscli"
  brew "tailscale"

  # dev tools for specific stacks
  # brew "k9s"
  # brew "redis"
  
  
  # macOS utilities
  brew "FelixKratz/formulae/borders"
  brew "felixkratz/formulae/sketchybar"

  # casks
  cask "google-chrome"
  cask "sublime-text"
  # cask "webstorm"
  cask "spotify"
  # cask "iterm2"
  cask "zoom"
  cask "slack"
  cask "obsidian"
  cask "postman"
  cask "raycast"
  cask "obs"
  cask "visual-studio-code"
  cask "1password"
  cask "1password/tap/1password-cli"
  cask "notion"
  cask "vlc"
  cask "nikitabobko/tap/aerospace"
  cask "ghostty"
  cask "arc"
  cask "superwhisper"
end

